#include "tig/art.h"

#include <stdio.h>

#include "tig/bmp.h"
#include "tig/color.h"
#include "tig/core.h"
#include "tig/debug.h"
#include "tig/file.h"
#include "tig/memory.h"
#include "tig/palette.h"
#include "tig/timer.h"
#include "tig/video.h"

#define ART_ID_TYPE_SHIFT 28
#define ART_ID_PALETTE_SHIFT 4
#define ART_ID_ROTATION_SHIFT 11

#define ART_ID_MAX_NUM 512
#define ART_ID_NUM_SHIFT 19

#define ART_ID_MAX_FRAME 32
#define ART_ID_FRAME_SHIFT 14

#define TILE_ID_MAX_NUM 64
#define TILE_ID_NUM1_SHIFT 22
#define TILE_ID_NUM2_SHIFT 16
#define TILE_ID_FLIPPABLE1_SHIFT 7
#define TILE_ID_FLIPPABLE2_SHIFT 6
#define FACADE_ID_TILE_NUM_SHIFT 11

#define TILE_ID_MAX_TYPE 2
#define TILE_ID_TYPE_SHIFT 8

#define CRITTER_ID_RACE_SHIFT 24

#define PORTAL_ID_MAX_TYPE 2
#define PORTAL_ID_TYPE_SHIFT 10

#define WALL_ID_MAX_NUM 256
#define WALL_ID_NUM_SHIFT 20

#define WALL_ID_MAX_P_PIECE 64
#define WALL_ID_P_PIECE_SHIFT 14

#define WALL_ID_MAX_VARIATION 4
#define WALL_ID_VARIATION_SHIFT 8

#define SCENERY_ID_MAX_TYPE 32
#define SCENERY_ID_TYPE_SHIFT 6

#define INTERFACE_ID_MAX_NUM 4096
#define INTERFACE_ID_NUM_SHIFT 16

#define INTERFACE_ID_MAX_FRAME 256
#define INTERFACE_ID_FRAME_SHIFT 8

#define ITEM_ID_MAX_ARMOR_COVERAGE 8
#define ITEM_ID_ARMOR_COVERAGE_SHIFT 14

#define ITEM_ID_MAX_DISPOSITION 4
#define ITEM_ID_DISPOSITION_SHIFT 12

#define ITEM_ID_MAX_SUBTYPE 16
#define ITEM_ID_SUBTYPE_SHIFT 6

#define ITEM_ID_MAX_TYPE 16
#define ITEM_ID_TYPE_SHIFT 0

#define CONTAINER_ID_MAX_TYPE 32
#define CONTAINER_ID_TYPE_SHIFT 6

#define LIGHT_ID_MAX_FRAME 128
#define LIGHT_ID_FRAME_SHIFT 12

#define LIGHT_ID_ROTATION_SHIFT 9

#define ROOF_FADE_SHIFT 12
#define ROOF_FILL_SHIFT 13

// NOTE: For unknown reason facade num is split into two parts. The base number
// is stored in bits 17..24. If bit 27 is set, then base number should be added
// 256.
#define FACADE_ID_MAX_NUM 512
#define FACADE_ID_NUM_HIGH_SHIFT 27
#define FACADE_ID_NUM_LOW_SHIFT 17

#define FACADE_ID_FLIPPABLE_SHIFT 26
#define FACADE_ID_TYPE_SHIFT 25

#define FACADE_ID_MAX_FRAME 1024
#define FACADE_ID_FRAME_SHIFT 1

#define UNIQUE_NPC_ID_MAX_NUM 256
#define UNIQUE_NPC_ID_NUM_SHIFT 20

#define EYE_CANDY_ID_MAX_FRAME 128
#define EYE_CANDY_ID_FRAME_SHIFT 12

#define EYE_CANDY_ID_ROTATION_SHIFT 9
#define EYE_CANDY_ID_TYPE_SHIFT 6

#define MONSTER_ID_SPECIE_SHIFT 23

#define MAX_PALETTES 4
#define MAX_ROTATIONS 8

// Represents memory size used in art cache.
//
// The type is signed. When used in "available" memory variables the value below
// zero denotes we've used too much memory and should evict something.
typedef int art_size_t;

typedef struct TigArtFileFrameData {
    /* 0000 */ int width;
    /* 0004 */ int height;
    /* 0008 */ int data_size;
    /* 000C */ int hot_x;
    /* 0010 */ int hot_y;
    /* 0014 */ int offset_x;
    /* 0018 */ int offset_y;
} TigArtFileFrameData;

static_assert(sizeof(TigArtFileFrameData) == 0x1C, "wrong size");

typedef struct TigArtHeader {
    /* 0000 */ unsigned int flags;
    /* 0004 */ int fps;
    /* 0008 */ int bpp;
    /* 000C */ uint32_t* palette_tbl[MAX_PALETTES];
    /* 001C */ int action_frame;
    /* 0020 */ int num_frames;
    /* 0024 */ TigArtFileFrameData* frames_tbl[MAX_ROTATIONS];
    /* 0044 */ int data_size[MAX_ROTATIONS];
    /* 0064 */ uint8_t* pixels_tbl[MAX_ROTATIONS];
} TigArtHeader;

static_assert(sizeof(TigArtHeader) == 0x84, "wrong size");

typedef struct TigArtFrameSave {
    /* 0000 */ int field_0;
    /* 0004 */ int field_4;
    /* 0008 */ int field_8;
    /* 000C */ int field_C;
} TigArtFrameSave;

static_assert(sizeof(TigArtFrameSave) == 0x10, "wrong size");

typedef struct TigShdHeader {
    /* 0000 */ unsigned int flags;
    /* 0004 */ int num_frames;
    /* 0004 */ TigArtFrameSave* field_8[MAX_ROTATIONS];
    /* 0028 */ int field_28[MAX_ROTATIONS];
    /* 0048 */ void* field_48[MAX_ROTATIONS];
} TigShdHeader;

static_assert(sizeof(TigShdHeader) == 0x68, "wrong size");

#define TIG_ART_CACHE_ENTRY_MODIFIED 0x02

typedef struct TigArtCacheEntry {
    /* 0000 */ unsigned int flags;
    /* 0004 */ char path[TIG_MAX_PATH];
    /* 0108 */ tig_timestamp_t time;
    /* 010C */ unsigned int art_id;
    /* 0110 */ TigArtHeader hdr;
    /* 0194 */ uint8_t field_194[MAX_PALETTES][MAX_ROTATIONS];
    /* 01B4 */ TigVideoBuffer** video_buffers[MAX_PALETTES][MAX_ROTATIONS];
    /* 0234 */ uint8_t** pixels_tbl[MAX_ROTATIONS];
    /* 0254 */ TigPalette palette_tbl[MAX_PALETTES];
    /* 0264 */ art_size_t system_memory_usage;
    /* 0268 */ art_size_t video_memory_usage;
} TigArtCacheEntry;

static_assert(sizeof(TigArtCacheEntry) == 0x26C, "wrong size");

static int art_get_video_buffer(unsigned int cache_entry_index, tig_art_id_t art_id, TigVideoBuffer** video_buffer_ptr);
static int sub_505940(unsigned int art_blt_flags, unsigned int* vb_blt_flags_ptr);
static int sub_5059F0(int cache_entry_index, TigArtBlitInfo* blit_info);
static int art_blit(int cache_entry_index, TigArtBlitInfo* blit_info);
static unsigned int sub_51AA90(tig_art_id_t art_id);
static void tig_art_cache_check_fullness();
static int tig_art_cache_entry_compare_time(const void* a1, const void* a2);
static int tig_art_cache_entry_compare_name(const void* a1, const void* a2);
static int tig_art_build_path(unsigned int art_id, char* path);
static bool tig_art_cache_find(const char* path, int* index);
static bool tig_art_cache_entry_load(tig_art_id_t art_id, const char* path, int index);
