// MENU
// ---
//
// The MENU subsystem provides several widgets that resemble DOS style windows.
// These widgets could have been used in early iterations of Arcanum/TIG
// development. The game does not use any of the functions from this subsystem
// besides `init` and `exit` pair.
//
// In fact there is a couple of bugs which makes it useless:
//
// - The internal implementation of modal loops is wrong. The loops in question
// only call `tig_ping` that "pumps" internal message queue with TIG messages as
// well as Windows Messages. However in order to process them ("peek" phase) a
// loop with `tig_message_dequeue` is required. The correct implementation of
// internal event can be seen in `tig_window_modal_dialog`.
//
// - The width calculation in `tig_menu_drop_down_create` is wrong resulting in
// some menu items not being rendered (due to clipping).

#include "tig/menu.h"

#include "tig/art.h"
#include "tig/button.h"
#include "tig/color.h"
#include "tig/core.h"
#include "tig/font.h"
#include "tig/kb.h"
#include "tig/memory.h"
#include "tig/rect.h"
#include "tig/window.h"

// The maximum number of menu bars.
//
// NOTE: This number should likely be the same as `MAX_WINDOWS`.
#define MAX_MENU_BARS 50

// The maximum number of drop downs in menu bar.
#define MAX_DROP_DOWNS 10

typedef struct TigMenuDropDown {
    /* 0000 */ const char** menu_items;
    /* 0004 */ int num_menu_items;
    /* 0008 */ int item_width;
    /* 000C */ int item_height;
    /* 0010 */ tig_window_handle_t window_handle;
    /* 0014 */ TigRect frame;
    /* 0024 */ unsigned int* flags;
} TigMenuDropDown;

static_assert(sizeof(TigMenuDropDown) == 0x28, "wrong size");

// Indicates that menu bar is unused.
#define TIG_MENU_BAR_UNUSED 0x01

typedef struct TigMenuBar {
    /* 0000 */ unsigned int usage;
    /* 0004 */ tig_window_handle_t window_handle;
    /* 0008 */ TigRect frame;
    /* 0018 */ int num_drop_downs;
    /* 001C */ const char** drop_downs;
    /* 0020 */ int* num_menu_items;
    /* 0024 */ const char** menu_items;
    /* 0028 */ unsigned int* flags;
    /* 002C */ tig_button_handle_t* buttons;
} TigMenuBar;

static_assert(sizeof(TigMenuBar) == 0x30, "wrong size");

static bool sub_5395E0(TigMessage* msg);
static int tig_menu_bar_destroy(int menu_bar_handle);
static void refresh_menu_items(tig_window_handle_t window_handle, int x, int y, const char** menu_items, int num_menu_items, int selected, int item_width, int item_height, unsigned int* flags);
static int calculate_drop_down_item_size(const char* title, const char** menu_items, int num_menu_items, int* width_ptr, int* height_ptr);
static int tig_menu_bar_get_free_index();
static int tig_menu_bar_find_drop_down(tig_button_handle_t button_handle, int* drop_down_index_ptr);
static int tig_menu_bar_handle_to_index(int handle);
static int tig_menu_bar_index_to_handle(int index);
static bool tig_menu_drop_down_create(const char** menu_items, int num_menu_items, int x, int y, unsigned int* flags, TigMenuDropDown* drop_down);
