#include "tig/net.h"

#include <stdio.h>

#include "tig/core.h"
#include "tig/debug.h"
#include "tig/file.h"
#include "tig/idxtable.h"
#include "tig/memory.h"
#include "tig/net_blacklist.h"
#include "tig/net_xfer.h"
#include "tig/timer.h"
#include "tig/video.h"

#define TIG_NET_PROTOCOL_VERSION 25
#define TIG_NET_SERVER_PORT 31434
#define TIG_NET_CLIENT_PORT 31435
#define TIG_NET_BUF_SIZE 0x2000

#define TIG_NET_CLIENT_CONNECTED 0x01
#define TIG_NET_CLIENT_LOADING 0x02
#define TIG_NET_CLIENT_WAITING 0x04
#define TIG_NET_CLIENT_SHUTTING_DOWN 0x08
#define TIG_NET_CLIENT_LAGGING 0x10

#define TIG_NET_UNUSED0 0
#define TIG_NET_GENERIC 1
#define TIG_NET_SERVER_CMD 2
#define TIG_NET_APP 3
#define TIG_NET_UNUSED1 4
#define TIG_NET_UNUSED2 5
#define TIG_NET_UNUSED3 6
#define TIG_NET_BCAST_PING 7
#define TIG_NET_ALIVE 8

#define TIG_NET_JOIN_REQUEST 0
#define TIG_NET_ALLOW_JOIN 1
#define TIG_NET_DISALLOW_JOIN 2
#define TIG_NET_CLIENT_DETAILS 3
#define TIG_NET_SERVER_DETAILS 4
#define TIG_NET_CLIENT_DISCONNECT 5
#define TIG_NET_SERVER_DISCONNECT 6

typedef int(__stdcall WS_WSAFDISSET)(SOCKET s, fd_set* set);
typedef SOCKET(__stdcall WS_ACCEPT)(SOCKET s, struct sockaddr* addr, int* addrlen);
typedef int(__stdcall WS_BIND)(SOCKET s, const struct sockaddr* name, int namelen);
typedef int(__stdcall WS_CLOSESOCKET)(SOCKET s);
typedef int(__stdcall WS_CONNECT)(SOCKET s, const struct sockaddr* name, int namelen);
typedef int(__stdcall WS_IOCTLSOCKET)(SOCKET s, int cmd, u_long* argp);

typedef SOCKET(__stdcall WS_WSASOCKETW)(int af, int type, int protocol, LPWSAPROTOCOL_INFOW lpProtocolInfo, GROUP g, DWORD dwFlags);
typedef DWORD(__stdcall WS_WSAWAITFORMULTIPLEEVENTS)(DWORD cEvents, const HANDLE* lphEvents, BOOL fWaitAll, DWORD dwTimeout, BOOL fAlertable);
typedef INT(__stdcall WS_WSAADDRESSTOSTRINGA)(LPSOCKADDR lpsaAddress, DWORD dwAddressLength, LPWSAPROTOCOL_INFOA lpProtocolInfo, LPSTR lpszAddressString, LPDWORD lpdwAddressStringLength);
typedef INT(__stdcall WS_WSAADDRESSTOSTRINGW)(LPSOCKADDR lpsaAddress, DWORD dwAddressLength, LPWSAPROTOCOL_INFOW lpProtocolInfo, LPWSTR lpszAddressString, LPDWORD lpdwAddressStringLength);
typedef INT(__stdcall WS_WSASTRINGTOADDRESSA)(LPSTR AddressString, INT AddressFamily, LPWSAPROTOCOL_INFOA lpProtocolInfo, LPSOCKADDR lpAddress, LPINT lpAddressLength);
typedef INT(__stdcall WS_WSASTRINGTOADDRESSW)(LPWSTR AddressString, INT AddressFamily, LPWSAPROTOCOL_INFOW lpProtocolInfo, LPSOCKADDR lpAddress, LPINT lpAddressLength);
typedef INT(__stdcall WS_WSALOOKUPSERVICEBEGINA)(LPWSAQUERYSETA lpqsRestrictions, DWORD dwControlFlags, LPHANDLE lphLookup);
typedef INT(__stdcall WS_WSALOOKUPSERVICEBEGINW)(LPWSAQUERYSETW lpqsRestrictions, DWORD dwControlFlags, LPHANDLE lphLookup);
typedef INT(__stdcall WS_WSALOOKUPSERVICENEXTA)(HANDLE hLookup, DWORD dwControlFlags, LPDWORD lpdwBufferLength, LPWSAQUERYSETA lpqsResults);
typedef INT(__stdcall WS_WSALOOKUPSERVICENEXTW)(HANDLE hLookup, DWORD dwControlFlags, LPDWORD lpdwBufferLength, LPWSAQUERYSETW lpqsResults);
typedef INT(__stdcall WS_WSALOOKUPSERVICEEND)(HANDLE hLookup);
typedef INT(__stdcall WS_WSAINSTALLSERVICECLASSA)(LPWSASERVICECLASSINFOA lpServiceClassInfo);
typedef INT(__stdcall WS_WSAINSTALLSERVICECLASSW)(LPWSASERVICECLASSINFOW lpServiceClassInfo);
typedef INT(__stdcall WS_WSAREMOVESERVICECLASS)(LPGUID lpServiceClassId);
typedef INT(__stdcall WS_WSAGETSERVICECLASSINFOA)(LPGUID lpProviderId, LPGUID lpServiceClassId, LPDWORD lpdwBufSize, LPWSASERVICECLASSINFOA lpServiceClassInfo);
typedef INT(__stdcall WS_WSAGETSERVICECLASSINFOW)(LPGUID lpProviderId, LPGUID lpServiceClassId, LPDWORD lpdwBufSize, LPWSASERVICECLASSINFOW lpServiceClassInfo);
typedef INT(__stdcall WS_WSAENUMNAMESPACEPROVIDERSA)(LPDWORD lpdwBufferLength, LPWSANAMESPACE_INFOA lpnspBuffer);
typedef INT(__stdcall WS_WSAENUMNAMESPACEPROVIDERSW)(LPDWORD lpdwBufferLength, LPWSANAMESPACE_INFOW lpnspBuffer);
typedef INT(__stdcall WS_WSAGETSERVICECLASSNAMEBYCLASSIDA)(LPGUID lpServiceClassId, LPSTR lpszServiceClassName, LPDWORD lpdwBufferLength);
typedef INT(__stdcall WS_WSAGETSERVICECLASSNAMEBYCLASSIDW)(LPGUID lpServiceClassId, LPWSTR lpszServiceClassName, LPDWORD lpdwBufferLength);
typedef INT(__stdcall WS_WSASETSERVICEA)(LPWSAQUERYSETA lpqsRegInfo, WSAESETSERVICEOP essoperation, DWORD dwControlFlags);
typedef INT(__stdcall WS_WSASETSERVICEW)(LPWSAQUERYSETW lpqsRegInfo, WSAESETSERVICEOP essoperation, DWORD dwControlFlags);

// NOTE: Functions appear ordered in the binary implying they were arranged in
// a struct. Only a small fraction of these functions are actually used.
typedef struct TigNetWinSockProcs {
    WS_WSAFDISSET* WSAFDIsSet;
    WS_ACCEPT* accept;
    WS_BIND* bind;
    WS_CLOSESOCKET* closesocket;
    WS_CONNECT* connect;
    WS_IOCTLSOCKET* ioctlsocket;
    WS_GETPEERNAME* getpeername;
    WS_GETSOCKNAME* getsockname;
    WS_GETSOCKOPT* getsockopt;
    WS_HTONL* htonl;
    WS_HTONS* htons;
    WS_INET_ADDR* inet_addr;
    WS_INET_NTOA* inet_ntoa;
    WS_LISTEN* listen;
    WS_NTOHL* ntohl;
    WS_NTOHS* ntohs;
    WS_RECV* recv;
    WS_RECVFROM* recvfrom;
    WS_SELECT* select;
    WS_SEND* send;
    WS_SENDTO* sendto;
    WS_SETSOCKOPT* setsockopt;
    WS_SHUTDOWN* shutdown;
    WS_SOCKET* socket;
    WS_GETHOSTBYADDR* gethostbyaddr;
    WS_GETHOSTBYNAME* gethostbyname;
    WS_GETHOSTNAME* gethostname;
    WS_GETSERVBYPORT* getservbyport;
    WS_GETSERVBYNAME* getservbyname;
    WS_GETPROTOBYNUMBER* getprotobynumber;
    WS_GETPROTOBYNAME* getprotobyname;
    WS_WSASTARTUP* WSAStartup;
    WS_WSACLEANUP* WSACleanup;
    WS_WSASETLASTERROR* WSASetLastError;
    WS_WSAGETLASTERROR* WSAGetLastError;
    WS_WSAISBLOCKING* WSAIsBlocking;
    WS_WSAUNHOOKBLOCKINGHOOK* WSAUnhookBlockingHook;
    WS_WSASETBLOCKINGHOOK* WSASetBlockingHook;
    WS_WSACANCELBLOCKINGCALL* WSACancelBlockingCall;
    WS_WSAASYNCGETSERVBYNAME* WSAAsyncGetServByName;
    WS_WSAASYNCGETSERVBYPORT* WSAAsyncGetServByPort;
    WS_WSAASYNCGETPROTOBYNAME* WSAAsyncGetProtoByName;
    WS_WSAASYNCGETPROTOBYNUMBER* WSAAsyncGetProtoByNumber;
    WS_WSAASYNCGETHOSTBYNAME* WSAAsyncGetHostByName;
    WS_WSAASYNCGETHOSTBYADDR* WSAAsyncGetHostByAddr;
    WS_WSACANCELASYNCREQUEST* WSACancelAsyncRequest;
    WS_WSAASYNCSELECT* WSAAsyncSelect;
    WS_WSAACCEPT* WSAAccept;
    WS_WSACLOSEEVENT* WSACloseEvent;
    WS_WSACONNECT* WSAConnect;
    WS_WSACREATEEVENT* WSACreateEvent;
    WS_WSADUPLICATESOCKETA* WSADuplicateSocketA;
    WS_WSADUPLICATESOCKETW* WSADuplicateSocketW;
    WS_WSAENUMNETWORKEVENTS* WSAEnumNetworkEvents;
    WS_WSAENUMPROTOCOLSA* WSAEnumProtocolsA;
    WS_WSAENUMPROTOCOLSW* WSAEnumProtocolsW;
    WS_WSAEVENTSELECT* WSAEventSelect;
    WS_WSAEVENTSELECT* WSAEventSelect_; // FIXME: Duplicate of `WSAEventSelect`.
    WS_WSAGETQOSBYNAME* WSAGetQOSByName;
    WS_WSAHTONL* WSAHtonl;
    WS_WSAHTONS* WSAHtons;
    WS_WSAIOCTL* WSAIoctl;
    WS_WSAJOINLEAF* WSAJoinLeaf;
    WS_WSANTOHL* WSANtohl;
    WS_WSANTOHS* WSANtohs;
    WS_WSARECV* WSARecv;
    WS_WSARECVDISCONNECT* WSARecvDisconnect;
    WS_WSARECVFROM* WSARecvFrom;
    WS_WSARESETEVENT* WSAResetEvent;
    WS_WSASEND* WSASend;
    WS_WSASENDDISCONNECT* WSASendDisconnect;
    WS_WSASENDTO* WSASendTo;
    WS_WSASETEVENT* WSASetEvent;
    WS_WSASOCKETA* WSASocketA;
    WS_WSASOCKETW* WSASocketW;
    WS_WSAWAITFORMULTIPLEEVENTS* WSAWaitForMultipleEvents;
    WS_WSAADDRESSTOSTRINGA* WSAAddressToStringA;
    WS_WSAADDRESSTOSTRINGW* WSAAddressToStringW;
    WS_WSASTRINGTOADDRESSA* WSAStringToAddressA;
    WS_WSASTRINGTOADDRESSW* WSAStringToAddressW;
    WS_WSALOOKUPSERVICEBEGINA* WSALookupServiceBeginA;
    WS_WSALOOKUPSERVICEBEGINW* WSALookupServiceBeginW;
    WS_WSALOOKUPSERVICENEXTA* WSALookupServiceNextA;
    WS_WSALOOKUPSERVICENEXTW* WSALookupServiceNextW;
    WS_WSALOOKUPSERVICEEND* WSALookupServiceEnd;
    WS_WSAINSTALLSERVICECLASSA* WSAInstallServiceClassA;
    WS_WSAINSTALLSERVICECLASSW* WSAInstallServiceClassW;
    WS_WSAREMOVESERVICECLASS* WSARemoveServiceClass;
    WS_WSAGETSERVICECLASSINFOA* WSAGetServiceClassInfoA;
    WS_WSAGETSERVICECLASSINFOW* WSAGetServiceClassInfoW;
    WS_WSAENUMNAMESPACEPROVIDERSA* WSAEnumNameSpaceProvidersA;
    WS_WSAENUMNAMESPACEPROVIDERSW* WSAEnumNameSpaceProvidersW;
    WS_WSAGETSERVICECLASSNAMEBYCLASSIDA* WSAGetServiceClassNameByClassIdA;
    WS_WSAGETSERVICECLASSNAMEBYCLASSIDW* WSAGetServiceClassNameByClassIdW;
    WS_WSASETSERVICEA* WSASetServiceA;
    WS_WSASETSERVICEW* WSASetServiceW;
} TigNetWsProcs;

typedef struct TigNetSocket {
    struct sockaddr_in addr;
    SOCKET s;
} TigNetSocket;

typedef struct TigNetClientStats {
    tig_timestamp_t accept_timestamp;
    int bytes_received;
    int bytes_sent;
    int num_read_messages;
    int num_read_calls;
    int num_write_messages;
    int num_write_calls;
    int packets_received;
    int packets_sent;
} TigNetClientStats;

static_assert(sizeof(TigNetClientStats) == 0x24, "wrong size");

typedef struct TigNetClient {
    int client_id;
    char name[TIG_NET_CLIENT_NAME_LENGTH];
    unsigned int flags;
    SOCKET s;
    struct sockaddr_in addr;
    uint8_t data[TIG_NET_BUF_SIZE];
    int field_2034;
    uint8_t* field_2038;
    uint8_t* field_203C;
    int field_2040;
    TigNetClientStats stats;
    int field_2068;
    unsigned int field_206C;
} TigNetClient;

static_assert(sizeof(TigNetClient) == 0x2070, "wrong size");

typedef struct TigNetPacketHeader {
    uint8_t version;
    uint8_t type;
    uint16_t size;
} TigNetPacketHeader;

// TIG_NET_SERVER_CMD / TIG_NET_JOIN_REQUEST
typedef struct TigNetJoinRequestMsg {
    /* 0000 */ int type;
    /* 0004 */ char name[TIG_NET_CLIENT_NAME_LENGTH - 1];
    /* 001B */ char password[TIG_NET_PASSWORD_NAME_SIZE - 1];
    /* 0034 */ int field_34;
    /* 0038 */ int extra_size;
} TigNetJoinRequestMsg;

typedef struct TigNetJoinRequestPacket {
    /* 0000 */ TigNetPacketHeader hdr;
    /* 0004 */ TigNetJoinRequestMsg msg;
} TigNetJoinRequestPacket;

static_assert(sizeof(TigNetJoinRequestPacket) == 0x40, "wrong size");

// TIG_NET_SERVER_CMD / TIG_NET_JOIN_REQUEST
typedef struct TigNetAllowJoinMsg {
    /* 0000 */ int type;
    /* 0004 */ int client_id;
    /* 0008 */ char client_names[TIG_NET_MAX_PLAYERS][TIG_NET_CLIENT_NAME_LENGTH - 1];
    /* 00C0 */ int client_flags[TIG_NET_MAX_PLAYERS];
    /* 00E0 */ int client_ids[TIG_NET_MAX_PLAYERS];
    /* 0100 */ int max_players;
    /* 0104 */ int server_options;
} TigNetAllowJoinMsg;

typedef struct TigNetAllowJoinPacket {
    /* 0000 */ TigNetPacketHeader hdr;
    /* 0004 */ TigNetAllowJoinMsg msg;
} TigNetAllowJoinPacket;

static_assert(sizeof(TigNetAllowJoinPacket) == 0x10C, "wrong size");

// TIG_NET_SERVER_CMD / TIG_NET_DISALLOW_JOIN
typedef struct TigNetDisallowJoinMsg {
    /* 0000 */ int type;
} TigNetDisallowJoinMsg;

typedef struct TigNetDisallowJoinPacket {
    /* 0000 */ TigNetPacketHeader hdr;
    /* 0004 */ TigNetDisallowJoinMsg msg;
} TigNetDisallowJoinPacket;

static_assert(sizeof(TigNetDisallowJoinPacket) == 0x8, "wrong size");

// TIG_NET_SERVER_CMD / TIG_NET_CLIENT_DETAILS
typedef struct TigNetClientDetailsMsg {
    /* 0000 */ int type;
    /* 0004 */ int client_id;
    /* 0008 */ char client_name[TIG_NET_CLIENT_NAME_LENGTH - 1];
    /* 0020 */ unsigned int client_flags;
} TigNetClientDetailsMsg;

typedef struct TigNetClientDetailsPacket {
    /* 0000 */ TigNetPacketHeader hdr;
    /* 0004 */ TigNetClientDetailsMsg msg;
} TigNetClientDetailsPacket;

static_assert(sizeof(TigNetClientDetailsPacket) == 0x28, "wrong size");

// TIG_NET_SERVER_CMD / TIG_NET_SERVER_DETAILS
typedef struct TigNetServerDetailsMsg {
    /* 0000 */ int type;
    /* 0004 */ TigNetServer info;
} TigNetServerDetailsMsg;

typedef struct TigNetServerDetailsPacket {
    /* 0000 */ TigNetPacketHeader hdr;
    /* 0004 */ TigNetServerDetailsMsg msg;
} TigNetServerDetailsPacket;

static_assert(sizeof(TigNetServerDetailsPacket) == 0x14C, "wrong size");

// TIG_NET_SERVER_CMD / TIG_NET_CLIENT_DISCONNECT
typedef struct TigNetClientDisconnectMsg {
    /* 0000 */ int type;
    /* 0004 */ int client_id;
    /* 0008 */ int reason;
} TigNetClientDisconnectMsg;

typedef struct TigNetClientDisconnectPacket {
    /* 0000 */ TigNetPacketHeader hdr;
    /* 0004 */ TigNetClientDisconnectMsg msg;
} TigNetClientDisconnectPacket;

static_assert(sizeof(TigNetClientDisconnectPacket) == 0x10, "wrong size");

// TIG_NET_SERVER_CMD / TIG_NET_SERVER_DISCONNECT
typedef struct TigNetServerDisconnectMsg {
    /* 0000 */ int type;
} TigNetServerDisconnectMsg;

typedef struct TigNetServerDisconnectPacket {
    /* 0000 */ TigNetPacketHeader hdr;
    /* 0004 */ TigNetServerDisconnectMsg msg;
} TigNetServerDisconnectPacket;

static_assert(sizeof(TigNetServerDisconnectPacket) == 0x8, "wrong size");

// TIG_NET_APP
typedef struct TigNetPacket {
    TigNetPacketHeader hdr;
    uint8_t data[8188];
} TigNetPacket;

static_assert(sizeof(TigNetPacket) == 0x2000, "wrong size");

// TIG_NET_BCAST_PING
typedef struct TigNetPingPacket {
    /* 0000 */ TigNetPacketHeader hdr;
    /* 0004 */ int type;
    /* 0008 */ int client_id;
    /* 000C */ tig_timestamp_t timestamp;
} TigNetPingPacket;

static_assert(sizeof(TigNetPingPacket) == 0x10, "wrong size");

// TIG_NET_ALIVE
typedef struct TigNetAlivePacket {
    /* 0000 */ TigNetPacketHeader hdr;
    /* 0004 */ int type;
    /* 0008 */ struct sockaddr_in addr;
    /* 0018 */ tig_timestamp_t time;
} TigNetAlivePacket;

static_assert(sizeof(TigNetAlivePacket) == 0x1C, "wrong size");

typedef struct TigNetRemoveServerListNode {
    int addr;
    struct TigNetRemoveServerListNode* next;
} TigNetRemoveServerListNode;

// 0x52A750
static_assert(sizeof(TigNetRemoveServerListNode) == 0x8, "wrong size");

static int __stdcall tig_net_fd_is_set(SOCKET s, fd_set* set);
static void tig_net_client_info_exit(TigNetClient* client);
static void tig_net_client_info_init(TigNetClient* client);
static void tig_net_print_client_stats(TigNetClientStats* stats);
static bool tig_net_ws_exit();
static void sub_527280();
static bool tig_net_ws_init();
static bool tig_net_ws_locate_procs_1_1();
static bool tig_net_ws_locate_procs_2_0();
static void sub_527AC0(int client_id);
static int sub_527AF0();
static bool tig_net_create_bcast_socket();
static void tig_net_bookmark_init(TigNetServer* bookmark);
static void sub_5280E0();
