#include "tig/video.h"

#include <d3d.h>
#include <stdio.h>

#include "tig/art.h"
#include "tig/bmp_utils.h"
#include "tig/color.h"
#include "tig/core.h"
#include "tig/debug.h"
#include "tig/draw.h"
#include "tig/file.h"
#include "tig/memory.h"
#include "tig/message.h"
#include "tig/mouse.h"
#include "tig/timer.h"
#include "tig/window.h"

typedef struct TigVideoBuffer {
    /* 0000 */ unsigned int flags;
    /* 0004 */ TigRect frame;
    /* 0014 */ int texture_width;
    /* 0018 */ int texture_height;
    /* 001C */ int pitch;
    /* 0020 */ unsigned int background_color;
    /* 0024 */ unsigned int color_key;
    /* 0028 */ LPDIRECTDRAWSURFACE7 surface;
    /* 002C */ DDSURFACEDESC2 surface_desc;
    /* 00A8 */ union {
        void* pixels;
        uint8_t* p8;
        uint16_t* p16;
        uint32_t* p32;
    } surface_data;
    /* 00AC */ int lock_count;
} TigVideoBuffer;

static_assert(sizeof(TigVideoBuffer) == 0xB0, "wrong size");

typedef struct TigVideoState {
    /* 0000 */ HINSTANCE instance;
    /* 0004 */ HWND wnd;
    /* 0008 */ LPDIRECTDRAW7 ddraw;
    /* 000C */ LPDIRECTDRAWSURFACE7 primary_surface;
    /* 0010 */ LPDIRECTDRAWSURFACE7 offscreen_surface;
    /* 0014 */ LPDIRECTDRAWSURFACE7 main_surface;
    /* 0018 */ LPDIRECTDRAWPALETTE palette;
    /* 001C */ LPDIRECT3D7 d3d;
    /* 0020 */ LPDIRECT3DDEVICE7 d3d_device;
    /* 0024 */ DDSURFACEDESC2 current_surface_desc;
    /* 00A0 */ LPDIRECTDRAWGAMMACONTROL gamma_control;
    /* 00A4 */ bool have_gamma_control;
    /* 00A8 */ DDGAMMARAMP default_gamma_ramp;
    /* 06A8 */ DDGAMMARAMP current_gamma_ramp;
    /* 0CA8 */ unsigned char field_CA8[1124];
} TigVideoState;

static_assert(sizeof(TigVideoState) == 0x110C, "wrong size");

static int tig_video_get_gamma_ramp(LPDDGAMMARAMP gamma_ramp);
static int tig_video_set_gamma_ramp(LPDDGAMMARAMP gamma_ramp);
static bool tig_video_platform_window_init(TigInitInfo* init_info);
static void tig_video_platform_window_exit();
static bool tig_video_ddraw_init(TigInitInfo* init_info);
static bool tig_video_ddraw_init_windowed(TigInitInfo* init_info);
static bool tig_video_ddraw_init_fullscreen(TigInitInfo* init_info);
static bool sub_524830();
static int tig_video_ddraw_exit();
static bool tig_video_d3d_init(TigInitInfo* init_info);
static HRESULT CALLBACK tig_video_3d_check_pixel_format(LPDDPIXELFORMAT lpDDPixFmt, LPVOID lpContext);
static void tig_video_d3d_exit();
static bool tig_video_ddraw_palette_create(LPDIRECTDRAW7 ddraw);
static void tig_video_ddraw_palette_destroy();
