#include "tig/window.h"

#include <ctype.h>

#include "tig/art.h"
#include "tig/bmp.h"
#include "tig/button.h"
#include "tig/color.h"
#include "tig/core.h"
#include "tig/debug.h"
#include "tig/font.h"
#include "tig/mouse.h"
#include "tig/rect.h"
#include "tig/video.h"

#define TIG_WINDOW_MAX 50
#define TIG_WINDOW_BUTTON_MAX 200

// The following constants define layout and visual style of modal dialog
// created by `tig_window_modal_dialog`.
//
// NOTE: For engine-like thing like TIG it's too much hardcoded stuff. Either
// it should not be part of the engine at all, or at least art ids should be
// externalized into `TigWindowModalDialogInfo`.

#define MODAL_DIALOG_WIDTH 325
#define MODAL_DIALOG_HEIGHT 136

#define MODAL_DIALOG_TEXT_X 30
#define MODAL_DIALOG_TEXT_Y 14
#define MODAL_DIALOG_TEXT_WIDTH 265
#define MODAL_DIALOG_TEXT_HEIGHT 65

#define MODAL_DIALOG_CENTER_BUTTON_X 149
#define MODAL_DIALOG_CENTER_BUTTON_Y 102

#define MODAL_DIALOG_OK_BUTTON_X 73
#define MODAL_DIALOG_OK_BUTTON_Y 102

#define MODAL_DIALOG_CANCEL_BUTTON_X 225
#define MODAL_DIALOG_CANCEL_BUTTON_Y 102

#define MODAL_DIALOG_FONT_ART_NUM 229
#define MODAL_DIALOG_BACKGROUND_ART_NUM 822
#define MODAL_DIALOG_OK_BUTTON_ART_NUM 823
#define MODAL_DIALOG_CANCEL_BUTTON_ART_NUM 824

typedef enum TigWindowUsage {
    TIG_WINDOW_USAGE_FREE = 1 << 0,
} TigWindowUsafe;

typedef struct TigWindow {
    /* 0000 */ unsigned int usage;
    /* 0004 */ unsigned int flags;
    /* 0008 */ TigRect frame;
    /* 0018 */ TigRect bounds;
    /* 0028 */ unsigned int background_color;
    /* 002C */ unsigned int color_key;
    /* 0030 */ TigVideoBuffer* video_buffer;
    /* 0034 */ TigVideoBuffer* secondary_video_buffer;
    /* 0038 */ int num_buttons;
    /* 003C */ tig_button_handle_t buttons[TIG_WINDOW_BUTTON_MAX];
    /* 035C */ TigWindowMessageFilterFunc* message_filter;
} TigWindow;

static int tig_window_free_index();
static int tig_window_handle_to_index(tig_window_handle_t window_handle);
static tig_window_handle_t tig_window_index_to_handle(int window_index);
static void push_window_stack(tig_window_handle_t window_handle);
static bool pop_window_stack(tig_window_handle_t window_handle);
static bool tig_window_modal_dialog_message_filter(TigMessage* msg);
static void tig_window_modal_dialog_close();
static void tig_window_modal_dialog_refresh(TigRect* rect);
static bool tig_window_modal_dialog_create_buttons(int type, tig_window_handle_t window_handle);
static bool tig_window_modal_dialog_init();
static void tig_window_modal_dialog_exit();

// 0x5BED98
static tig_window_handle_t tig_window_modal_dialog_window_handle = TIG_WINDOW_HANDLE_INVALID;

// 0x5BEDA0
static TigRect tig_window_modal_dialog_bounds = { 0, 0, MODAL_DIALOG_WIDTH, MODAL_DIALOG_HEIGHT };

// 0x604758
